app/views/cocktails/show.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "doses" ON "ingredients"."id" = "doses"."ingredient_id" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 13]]
---
    <ul class="list-group">
      <% @cocktail.ingredients.each do |ingredient| %>

SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 13]]
---
    <ul class="list-group">
      <% @cocktail.doses.each do |dose| %>