app/views/pages/home.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "doses" ON "ingredients"."id" = "doses"."ingredient_id" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 8]]
---
              <ul>
                <% cocktail.ingredients.each do |ingredient| %>