app/controllers/cocktails_controller.rb

SELECT "cocktails".* FROM "cocktails"
---
  def index
    @cocktails = Cocktail.all

SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    @cocktail = Cocktail.find(params[:id])

INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Wo"], ["created_at", "2023-11-19 16:59:05.254694"], ["updated_at", "2023-11-19 16:59:05.254694"]]
---
  def create
    @cocktail = Cocktail.new(cocktail_params)
    if @cocktail.save

SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "cocktails" WHERE "cocktails"."id" = $1  [["id", 14]]
---
  def destroy
    @cocktail = Cocktail.find(params[:id])
    @cocktail.destroy