app/controllers/doses_controller.rb

  def create
    @cocktail = Cocktail.find(params[:cocktail_id])
---
SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def destroy
    @dose = Dose.find(params[:id])
    @dose.destroy
---
SELECT "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 1]]