app/controllers/pages_controller.rb

SELECT "cocktails".* FROM "cocktails" LIMIT $1  [["LIMIT", 5]]
---
  def home
    @cocktails = Cocktail.all.limit(5)